OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18lf65k80.c
/*
 * This definitions of the PIC18LF65K80 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:58 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#include <pic18lf65k80.h>

//==============================================================================

__at(0x0E41) __sfr RXERRCNT;
__at(0x0E41) volatile __RXERRCNTbits_t RXERRCNTbits;

__at(0x0E42) __sfr TXERRCNT;
__at(0x0E42) volatile __TXERRCNTbits_t TXERRCNTbits;

__at(0x0E43) __sfr BRGCON1;
__at(0x0E43) volatile __BRGCON1bits_t BRGCON1bits;

__at(0x0E44) __sfr BRGCON2;
__at(0x0E44) volatile __BRGCON2bits_t BRGCON2bits;

__at(0x0E45) __sfr BRGCON3;
__at(0x0E45) volatile __BRGCON3bits_t BRGCON3bits;

__at(0x0E46) __sfr RXFCON0;
__at(0x0E46) volatile __RXFCON0bits_t RXFCON0bits;

__at(0x0E47) __sfr RXFCON1;
__at(0x0E47) volatile __RXFCON1bits_t RXFCON1bits;

__at(0x0E48) __sfr RXF6SIDH;
__at(0x0E48) volatile __RXF6SIDHbits_t RXF6SIDHbits;

__at(0x0E49) __sfr RXF6SIDL;
__at(0x0E49) volatile __RXF6SIDLbits_t RXF6SIDLbits;

__at(0x0E4A) __sfr RXF6EIDH;
__at(0x0E4A) volatile __RXF6EIDHbits_t RXF6EIDHbits;

__at(0x0E4B) __sfr RXF6EIDL;
__at(0x0E4B) volatile __RXF6EIDLbits_t RXF6EIDLbits;

__at(0x0E4C) __sfr RXF7SIDH;
__at(0x0E4C) volatile __RXF7SIDHbits_t RXF7SIDHbits;

__at(0x0E4D) __sfr RXF7SIDL;
__at(0x0E4D) volatile __RXF7SIDLbits_t RXF7SIDLbits;

__at(0x0E4E) __sfr RXF7EIDH;
__at(0x0E4E) volatile __RXF7EIDHbits_t RXF7EIDHbits;

__at(0x0E4F) __sfr RXF7EIDL;
__at(0x0E4F) volatile __RXF7EIDLbits_t RXF7EIDLbits;

__at(0x0E50) __sfr RXF8SIDH;
__at(0x0E50) volatile __RXF8SIDHbits_t RXF8SIDHbits;

__at(0x0E51) __sfr RXF8SIDL;
__at(0x0E51) volatile __RXF8SIDLbits_t RXF8SIDLbits;

__at(0x0E52) __sfr RXF8EIDH;
__at(0x0E52) volatile __RXF8EIDHbits_t RXF8EIDHbits;

__at(0x0E53) __sfr RXF8EIDL;
__at(0x0E53) volatile __RXF8EIDLbits_t RXF8EIDLbits;

__at(0x0E54) __sfr RXF9SIDH;
__at(0x0E54) volatile __RXF9SIDHbits_t RXF9SIDHbits;

__at(0x0E55) __sfr RXF9SIDL;
__at(0x0E55) volatile __RXF9SIDLbits_t RXF9SIDLbits;

__at(0x0E56) __sfr RXF9EIDH;
__at(0x0E56) volatile __RXF9EIDHbits_t RXF9EIDHbits;

__at(0x0E57) __sfr RXF9EIDL;
__at(0x0E57) volatile __RXF9EIDLbits_t RXF9EIDLbits;

__at(0x0E58) __sfr RXF10SIDH;
__at(0x0E58) volatile __RXF10SIDHbits_t RXF10SIDHbits;

__at(0x0E59) __sfr RXF10SIDL;
__at(0x0E59) volatile __RXF10SIDLbits_t RXF10SIDLbits;

__at(0x0E5A) __sfr RXF10EIDH;
__at(0x0E5A) volatile __RXF10EIDHbits_t RXF10EIDHbits;

__at(0x0E5B) __sfr RXF10EIDL;
__at(0x0E5B) volatile __RXF10EIDLbits_t RXF10EIDLbits;

__at(0x0E5C) __sfr RXF11SIDH;
__at(0x0E5C) volatile __RXF11SIDHbits_t RXF11SIDHbits;

__at(0x0E5D) __sfr RXF11SIDL;
__at(0x0E5D) volatile __RXF11SIDLbits_t RXF11SIDLbits;

__at(0x0E5E) __sfr RXF11EIDH;
__at(0x0E5E) volatile __RXF11EIDHbits_t RXF11EIDHbits;

__at(0x0E5F) __sfr RXF11EIDL;
__at(0x0E5F) volatile __RXF11EIDLbits_t RXF11EIDLbits;

__at(0x0E60) __sfr RXF12SIDH;
__at(0x0E60) volatile __RXF12SIDHbits_t RXF12SIDHbits;

__at(0x0E61) __sfr RXF12SIDL;
__at(0x0E61) volatile __RXF12SIDLbits_t RXF12SIDLbits;

__at(0x0E62) __sfr RXF12EIDH;
__at(0x0E62) volatile __RXF12EIDHbits_t RXF12EIDHbits;

__at(0x0E63) __sfr RXF12EIDL;
__at(0x0E63) volatile __RXF12EIDLbits_t RXF12EIDLbits;

__at(0x0E64) __sfr RXF13SIDH;
__at(0x0E64) volatile __RXF13SIDHbits_t RXF13SIDHbits;

__at(0x0E65) __sfr RXF13SIDL;
__at(0x0E65) volatile __RXF13SIDLbits_t RXF13SIDLbits;

__at(0x0E66) __sfr RXF13EIDH;
__at(0x0E66) volatile __RXF13EIDHbits_t RXF13EIDHbits;

__at(0x0E67) __sfr RXF13EIDL;
__at(0x0E67) volatile __RXF13EIDLbits_t RXF13EIDLbits;

__at(0x0E68) __sfr RXF14SIDH;
__at(0x0E68) volatile __RXF14SIDHbits_t RXF14SIDHbits;

__at(0x0E69) __sfr RXF14SIDL;
__at(0x0E69) volatile __RXF14SIDLbits_t RXF14SIDLbits;

__at(0x0E6A) __sfr RXF14EIDH;
__at(0x0E6A) volatile __RXF14EIDHbits_t RXF14EIDHbits;

__at(0x0E6B) __sfr RXF14EIDL;
__at(0x0E6B) volatile __RXF14EIDLbits_t RXF14EIDLbits;

__at(0x0E6C) __sfr RXF15SIDH;
__at(0x0E6C) volatile __RXF15SIDHbits_t RXF15SIDHbits;

__at(0x0E6D) __sfr RXF15SIDL;
__at(0x0E6D) volatile __RXF15SIDLbits_t RXF15SIDLbits;

__at(0x0E6E) __sfr RXF15EIDH;
__at(0x0E6E) volatile __RXF15EIDHbits_t RXF15EIDHbits;

__at(0x0E6F) __sfr RXF15EIDL;
__at(0x0E6F) volatile __RXF15EIDLbits_t RXF15EIDLbits;

__at(0x0E70) __sfr SDFLC;
__at(0x0E70) volatile __SDFLCbits_t SDFLCbits;

__at(0x0E71) __sfr RXFBCON0;
__at(0x0E71) volatile __RXFBCON0bits_t RXFBCON0bits;

__at(0x0E72) __sfr RXFBCON1;
__at(0x0E72) volatile __RXFBCON1bits_t RXFBCON1bits;

__at(0x0E73) __sfr RXFBCON2;
__at(0x0E73) volatile __RXFBCON2bits_t RXFBCON2bits;

__at(0x0E74) __sfr RXFBCON3;
__at(0x0E74) volatile __RXFBCON3bits_t RXFBCON3bits;

__at(0x0E75) __sfr RXFBCON4;
__at(0x0E75) volatile __RXFBCON4bits_t RXFBCON4bits;

__at(0x0E76) __sfr RXFBCON5;
__at(0x0E76) volatile __RXFBCON5bits_t RXFBCON5bits;

__at(0x0E77) __sfr RXFBCON6;
__at(0x0E77) volatile __RXFBCON6bits_t RXFBCON6bits;

__at(0x0E78) __sfr RXFBCON7;
__at(0x0E78) volatile __RXFBCON7bits_t RXFBCON7bits;

__at(0x0E79) __sfr MSEL0;
__at(0x0E79) volatile __MSEL0bits_t MSEL0bits;

__at(0x0E7A) __sfr MSEL1;
__at(0x0E7A) volatile __MSEL1bits_t MSEL1bits;

__at(0x0E7B) __sfr MSEL2;
__at(0x0E7B) volatile __MSEL2bits_t MSEL2bits;

__at(0x0E7C) __sfr MSEL3;
__at(0x0E7C) volatile __MSEL3bits_t MSEL3bits;

__at(0x0E7D) __sfr BSEL0;
__at(0x0E7D) volatile __BSEL0bits_t BSEL0bits;

